{
  "data": [
    {
      "keyword_id": "algoritma",
      "keyword_en": "algorithm",
      "definition_id": "Prosedur langkah demi langkah untuk menyelesaikan masalah atau melakukan komputasi.",
      "definition_en": "A step-by-step procedure for solving a problem or performing a computation."
    },
    {
      "keyword_id": "pohon biner",
      "keyword_en": "binary tree",
      "definition_id": "Struktur data hierarkis di mana setiap node memiliki paling banyak dua child node.",
      "definition_en": "A hierarchical data structure where each node has at most two child nodes."
    },
    {
      "keyword_id": "cache",
      "keyword_en": "cache",
      "definition_id": "Komponen hardware atau software yang menyimpan data agar permintaan di masa depan dapat dilayani lebih cepat.",
      "definition_en": "A hardware or software component that stores data so future requests can be served faster."
    },
    {
      "keyword_id": "basis data",
      "keyword_en": "database",
      "definition_id": "Kumpulan informasi atau data terstruktur yang tersimpan secara elektronik.",
      "definition_en": "A structured collection of information or data stored electronically."
    },
    {
      "keyword_id": "enkapsulasi",
      "keyword_en": "encapsulation",
      "definition_id": "Prinsip OOP yang menggabungkan data dan metode yang beroperasi pada data tersebut dalam satu unit.",
      "definition_en": "An OOP principle that combines data and the methods that operate on that data into a single unit."
    },
    {
      "keyword_id": "fungsi",
      "keyword_en": "function",
      "definition_id": "Blok kode yang dapat digunakan kembali untuk melakukan tugas tertentu.",
      "definition_en": "A block of code that can be reused to perform a specific task."
    },
    {
      "keyword_id": "graf",
      "keyword_en": "graph",
      "definition_id": "Struktur data yang terdiri dari node (vertex) dan edge yang menghubungkan node-node tersebut.",
      "definition_en": "A data structure consisting of nodes (vertices) and edges connecting those nodes."
    },
    {
      "keyword_id": "hash table",
      "keyword_en": "hash table",
      "definition_id": "Struktur data yang memetakan kunci ke nilai untuk pencarian data yang efisien.",
      "definition_en": "A data structure that maps keys to values for efficient data retrieval."
    },
    {
      "keyword_id": "inheritance",
      "keyword_en": "inheritance",
      "definition_id": "Mekanisme OOP di mana class baru mewarisi properti dan metode dari class yang sudah ada.",
      "definition_en": "An OOP mechanism where a new class inherits properties and methods from an existing class."
    },
    {
      "keyword_id": "json",
      "keyword_en": "json",
      "definition_id": "JavaScript Object Notation, format pertukaran data yang ringan dan mudah dibaca.",
      "definition_en": "JavaScript Object Notation, a lightweight and easy-to-read data interchange format."
    },
    {
      "keyword_id": "kernel",
      "keyword_en": "kernel",
      "definition_id": "Inti dari sistem operasi yang mengelola operasi komputer dan hardware.",
      "definition_en": "The core part of an operating system that manages computer operations and hardware."
    }
  ]
}
