{
  "data": [
    {
      "keyword_id": "algoritma",
      "keyword_en": "algorithm",
      "definition_id": "Prosedur langkah demi langkah untuk menyelesaikan masalah atau melakukan komputasi.",
      "definition_en": "A step-by-step procedure for solving a problem or performing a computation."
    },
    {
      "keyword_id": "pohon biner",
      "keyword_en": "binary tree",
      "definition_id": "Struktur data hierarkis di mana setiap node memiliki paling banyak dua child node.",
      "definition_en": "A hierarchical data structure where each node has at most two child nodes."
    },
    {
      "keyword_id": "cache",
      "keyword_en": "cache",
      "definition_id": "Komponen hardware atau software yang menyimpan data agar permintaan di masa depan dapat dilayani lebih cepat.",
      "definition_en": "A hardware or software component that stores data so future requests can be served faster."
    },
    {
      "keyword_id": "basis data",
      "keyword_en": "database",
      "definition_id": "Kumpulan informasi atau data terstruktur yang tersimpan secara elektronik.",
      "definition_en": "A structured collection of information or data stored electronically."
    },
    {
      "keyword_id": "enkapsulasi",
      "keyword_en": "encapsulation",
      "definition_id": "Prinsip OOP yang menggabungkan data dan metode yang beroperasi pada data tersebut dalam satu unit.",
      "definition_en": "An OOP principle that combines data and the methods that operate on that data into a single unit."
    },
    {
      "keyword_id": "fungsi",
      "keyword_en": "function",
      "definition_id": "Blok kode yang dapat digunakan kembali untuk melakukan tugas tertentu.",
      "definition_en": "A block of code that can be reused to perform a specific task."
    },
    {
      "keyword_id": "graf",
      "keyword_en": "graph",
      "definition_id": "Struktur data yang terdiri dari node (vertex) dan edge yang menghubungkan node-node tersebut.",
      "definition_en": "A data structure consisting of nodes (vertices) and edges connecting those nodes."
    },
    {
      "keyword_id": "hash table",
      "keyword_en": "hash table",
      "definition_id": "Struktur data yang memetakan kunci ke nilai untuk pencarian data yang efisien.",
      "definition_en": "A data structure that maps keys to values for efficient data retrieval."
    },
    {
      "keyword_id": "inheritance",
      "keyword_en": "inheritance",
      "definition_id": "Mekanisme OOP di mana class baru mewarisi properti dan metode dari class yang sudah ada.",
      "definition_en": "An OOP mechanism where a new class inherits properties and methods from an existing class."
    },
    {
      "keyword_id": "json",
      "keyword_en": "json",
      "definition_id": "JavaScript Object Notation, format pertukaran data yang ringan dan mudah dibaca.",
      "definition_en": "JavaScript Object Notation, a lightweight and easy-to-read data interchange format."
    },
    {
      "keyword_id": "kernel",
      "keyword_en": "kernel",
      "definition_id": "Inti dari sistem operasi yang mengelola operasi komputer dan hardware.",
      "definition_en": "The core part of an operating system that manages computer operations and hardware."
    },
    {
      "keyword_id": "linked list",
      "keyword_en": "linked list",
      "definition_id": "Struktur data linier di mana elemen (node) saling terhubung melalui pointer/referensi.",
      "definition_en": "A linear data structure where elements (nodes) are connected via pointers/references."
    },
    {
      "keyword_id": "rekursi",
      "keyword_en": "recursion",
      "definition_id": "Teknik di mana fungsi memanggil dirinya sendiri untuk memecah masalah menjadi sub-masalah yang lebih kecil.",
      "definition_en": "A technique where a function calls itself to break down a problem into smaller sub-problems."
    },
    {
      "keyword_id": "stack",
      "keyword_en": "stack",
      "definition_id": "Struktur data linier yang mengikuti prinsip LIFO (Last-In, First-Out).",
      "definition_en": "A linear data structure that follows the LIFO (Last-In, First-Out) principle."
    },
    {
      "keyword_id": "queue",
      "keyword_en": "queue",
      "definition_id": "Struktur data linier yang mengikuti prinsip FIFO (First-In, First-Out).",
      "definition_en": "A linear data structure that follows the FIFO (First-In, First-Out) principle."
    },
    {
      "keyword_id": "heap",
      "keyword_en": "heap",
      "definition_id": "Struktur data pohon khusus yang memenuhi sifat heap (biasanya max-heap atau min-heap).",
      "definition_en": "A specialized tree-based data structure that satisfies the heap property (usually max-heap or min-heap)."
    },
    {
      "keyword_id": "complexity time",
      "keyword_en": "time complexity",
      "definition_id": "Analisis yang mengestimasi waktu eksekusi algoritma sebagai fungsi dari ukuran input.",
      "definition_en": "Analysis that estimates an algorithm's execution time as a function of input size."
    },
    {
      "keyword_id": "pointer",
      "keyword_en": "pointer",
      "definition_id": "Variabel yang menyimpan alamat memori dari variabel lain.",
      "definition_en": "A variable that stores the memory address of another variable."
    },
    {
      "keyword_id": "polimorfisme",
      "keyword_en": "polymorphism",
      "definition_id": "Prinsip OOP yang memungkinkan objek untuk mengambil berbagai bentuk atau perilaku.",
      "definition_en": "An OOP principle that allows objects to take on multiple forms or behaviors."
    },
    {
      "keyword_id": "api",
      "keyword_en": "api",
      "definition_id": "Antarmuka Pemrograman Aplikasi, sekumpulan aturan untuk berinteraksi dengan software atau layanan.",
      "definition_en": "Application Programming Interface, a set of rules for interacting with software or services."
    },
    {
      "keyword_id": "git",
      "keyword_en": "git",
      "definition_id": "Sistem kontrol versi terdistribusi untuk melacak perubahan dalam kode sumber selama pengembangan perangkat lunak.",
      "definition_en": "A distributed version control system for tracking changes in source code during software development."
    },
    {
      "keyword_id": "dynamic programming",
      "keyword_en": "dynamic programming",
      "definition_id": "Teknik algoritmik untuk memecah masalah kompleks menjadi sub-masalah yang lebih sederhana dan menyimpan hasilnya.",
      "definition_en": "An algorithmic technique for breaking complex problems into simpler subproblems and storing their results."
    },
    {
      "keyword_id": "binary search",
      "keyword_en": "binary search",
      "definition_id": "Algoritma pencarian yang bekerja pada array terurut dengan membagi interval pencarian menjadi dua secara berulang.",
      "definition_en": "A search algorithm that works on sorted arrays by repeatedly dividing the search interval in half."
    },
    {
      "keyword_id": "rest",
      "keyword_en": "rest",
      "definition_id": "Arsitektur gaya perangkat lunak untuk membuat layanan web yang scalable (Representational State Transfer).",
      "definition_en": "A software architectural style for creating scalable web services (Representational State Transfer)."
    },
    {
      "keyword_id": "ajax",
      "keyword_en": "ajax",
      "definition_id": "Teknik pengembangan web untuk membuat aplikasi web yang interaktif dengan bertukar data secara asinkron.",
      "definition_en": "A web development technique for creating interactive web applications by exchanging data asynchronously."
    },
    {
      "keyword_id": "closure",
      "keyword_en": "closure",
      "definition_id": "Fungsi yang memiliki akses ke variabel dalam lingkup induknya, bahkan setelah fungsi induk selesai dieksekusi.",
      "definition_en": "A function that has access to variables in its parent scope, even after the parent function has finished executing."
    }
  ]
}
